Catalogs/ПЛ_УведомленияОСобытиях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПЛ_УведомленияОСобытиях</Name>
			<Comment>Содержит настройки рассылок и уведомлений заинтересованных лиц о событиях, происходящие в системе</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПЛ_События</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокПолучателей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбычныйТекст</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаШаблонаТекстовСообщения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиШаблонаТекстовСообщения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДелениеПоАдресатам</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПЛ_ДелениеУведомленийПоАдресатам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФильтрПоАдресатам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольПовторнойОтправки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПЛ_СпособыДоставкиУведомлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлПочта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СервисПочтовойРассылки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Напоминание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбратныйАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВложения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматВложений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗадание</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СпособАдресацииУведомления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПЛ_СпособыАдресацииУведомлений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адресат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СхемаВыборкиАдресатов</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НастройкиВыборкиАдресатов</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресСхемыВыборкиАдресатов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресНастроекВыборкиАдресатов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидУсловийОтправкиУведомления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПЛ_ВидыУсловийУведомлений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаУсловий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СхемаУсловийОтправкиУведомления</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НастройкиУсловийОтправкиУведомления</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресСхемыУсловий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресНастроекУсловий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Включен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицыШаблонов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Настройки</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресНастроек</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вложение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Вложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вложение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Картинка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПечатныеФормы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПечатнаяФорма</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Внешняя</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрисоединенныеФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вложение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ПЛ_СервисыПочтовойРассылки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПЛ_СервисыПочтовойРассылки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Sendsay</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>UniSender</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Mailchimp</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПЛ_УведомленияОСобытиях/Forms/НастройкиПараметровУведомлений/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВерсияУТ = ПЛ_УведомленияОСобытиях.ВерсияУТ();
	
	Платформа83 = ПЛ_УведомленияОСобытиях.Платформа83();
	
	ПЛ_УведомленияОСобытиях.ПроверитьНастройкиСпособовДоставки(ПочтаНастроена, СМСДоступны, СМСНастроены, НапоминанияДоступны, ПодключенСервисПочтовойРассылки);
	
	Если СМСДоступны И СМСНастроены Тогда
		СформироватьТекстНастройкиСМС();
	КонецЕсли;
	
	СтруктураНастроек = Константы.ПЛ_НастройкиУведомлений.СоздатьМенеджерЗначения().ПолучитьНастройки();
	
	// Способ отправки писем и учетная запись
	НастройкиСервисаПочтовойРассылки = "";
	Если СтруктураНастроек.Свойство("НастройкиСервисаПочтовойРассылки", НастройкиСервисаПочтовойРассылки) Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, НастройкиСервисаПочтовойРассылки);
	КонецЕсли;
	
	УчетнаяЗаписьУказываетсяВручную = Истина;
	
	ИмяСправочника = "УчетныеЗаписиЭлектроннойПочты";
	МетаданныеСправочника = Метаданные.Справочники.Найти(ИмяСправочника);
	Если МетаданныеСправочника <> Неопределено
		И Не Найти(МетаданныеСправочника.Представление(), НСтр("ru = 'не используется'")) Тогда
		ТипСправочника = "СправочникСсылка." + МетаданныеСправочника.Имя;
		Элементы.УчетнаяЗапись.ОграничениеТипа = Новый ОписаниеТипов(ТипСправочника);
		Элементы.УчетнаяЗапись.ВыбиратьТип = Ложь;
		УчетнаяЗаписьУказываетсяВручную = Ложь;
		ЭтоНеизвестнаяКонфигурация = Ложь;
	КонецЕсли;
	
	Если УчетнаяЗаписьУказываетсяВручную Тогда
		НастройкиУчетнойЗаписи = "";
		Если СтруктураНастроек.Свойство("НастройкиУчетнойЗаписи", НастройкиУчетнойЗаписи) <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(ЭтаФорма, НастройкиУчетнойЗаписи);
		КонецЕсли;
	Иначе
		СистемнаяУчетнаяЗапись = "";
		Если СтруктураНастроек.Свойство("СистемнаяУчетнаяЗапись", СистемнаяУчетнаяЗапись) <> Неопределено Тогда
			УчетнаяЗапись = СистемнаяУчетнаяЗапись;
		КонецЕсли;
	КонецЕсли;
	
	СтруктураНастроек.Свойство("СохранятьЭлектронныеПисьма", СохранятьЭлектронныеПисьма);
	
	// Подписи
	ПодписиСообщений = "";
	Если СтруктураНастроек.Свойство("ПодписиСообщений", ПодписиСообщений) <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ПодписиСообщений);
	КонецЕсли;
	
	// Использование подсистемы
	СтрокаСоединения = СтруктураНастроек.СтрокаСоединенияРабочейБазы;
	ПодсистемаВключена = (СтруктураНастроек.СтрокаСоединенияРабочейБазы = ВРег(СтрокаСоединенияИнформационнойБазы()));
	
	// СМС
	НастройкиСМС = "";
	Если СтруктураНастроек.Свойство("НастройкиСМС", НастройкиСМС) <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, НастройкиСМС);
	КонецЕсли;
	
	ДобавлятьКодСтраны = ЗначениеЗаполнено(ТелефонныйКодСтраны);
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	Если СохранятьПриЗакрытии Тогда
		СохранитьНастройки();
		Оповестить("Запись_НастройкиУведомлений");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_НастройкиОтправкиSMS" Тогда
		СформироватьТекстНастройкиСМС();
	ИначеЕсли ИмяСобытия = "Настроены_Параметры_Подключения" Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметр);
		ПодключенСервисПочтовойРассылки = ЗначениеЗаполнено(ЛогинПочтовойРассылки);
		УстановитьВидимость();
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ПодсистемаВключенаПриИзменении(Элемент)
	
	Если ПодсистемаВключена Тогда
		СтрокаСоединения = ВРег(СтрокаСоединенияИнформационнойБазы());
	Иначе
		СтрокаСоединения = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавлятьКодСтраныПриИзменении(Элемент)
	
	Если Не ДобавлятьКодСтраны Тогда
		ТелефонныйКодСтраны = "";
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура СервисПочтовойРассылкиПриИзменении(Элемент)
	
	ПодключенСервисПочтовойРассылки = Ложь;
	ЛогинПочтовойРассылки = "";
	ПарольПочтовойРассылки = "";
	
	СервисПочтовойРассылкиПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СервисПочтовойРассылкиПриИзмененииНаСервере()
	
	УстановитьВидимость();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ПроверитьУчетнуюЗапись(Команда)
	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	ЗаполнитьЗначенияСвойств(Профиль, ЭтаФорма);
	
	ИнтернетПочта = Новый ИнтернетПочта;
	Попытка
		ИнтернетПочта.Подключиться(Профиль);
	Исключение
		Элементы.Декорация1.Заголовок = НСтр("ru = 'Ошибка при соединении.'");
		Элементы.Декорация1.ЦветТекста = Новый Цвет(128, 0, 0);
		
		Текстошибки = НСтр("ru = 'Проверка параметров учетной записи завершилась с ошибками: %Ошибка%'");
		Текстошибки = СтрЗаменить(Текстошибки, "%Ошибка%", КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Предупреждение(Текстошибки);
		Возврат;
	КонецПопытки;
	
	Элементы.Декорация1.Заголовок = НСтр("ru = 'Соединение успешно.'");
	Элементы.Декорация1.ЦветТекста = Новый Цвет(0, 128, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	
	СохранятьПриЗакрытии = Истина;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьСМС(Команда)
	
	Если СМСДоступны Тогда
		ОткрытьФорму("ОбщаяФорма.НастройкаОтправкиSMS");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьНастроитьСервисРассылок(Команда)
	
	ПараметрыПодключения = Новый Структура;
	ПараметрыПодключения.Вставить("СервисПочтовойРассылки", СервисПочтовойРассылки);
	ПараметрыПодключения.Вставить("ЛогинПочтовойРассылки", ЛогинПочтовойРассылки);
	ПараметрыПодключения.Вставить("ПарольПочтовойРассылки", ПарольПочтовойРассылки);
	
	ПараметрыФормы = Новый Структура("ПараметрыПодключения", ПараметрыПодключения);
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ОткрытьФормуМодально("Справочник.ПЛ_УведомленияОСобытиях.Форма.НастройкаПодключенияКСервисуРассылок", ПараметрыФормы, ЭтаФорма);
	#Иначе
		Выполнить("ОткрытьФорму(""Справочник.ПЛ_УведомленияОСобытиях.Форма.НастройкаПодключенияКСервисуРассылок"", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)");
	#КонецЕсли
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура СохранитьНастройки()
	
	// Учетная запись
	Если УчетнаяЗаписьУказываетсяВручную Тогда
		НастройкиУчетнойЗаписи = СтруктураНастроек.НастройкиУчетнойЗаписи;
		ЗаполнитьЗначенияСвойств(НастройкиУчетнойЗаписи, ЭтаФорма);
		НастройкиУчетнойЗаписи.ТребуетсяSMTPАутентификация = Истина;
	Иначе
		СтруктураНастроек.СистемнаяУчетнаяЗапись = УчетнаяЗапись;
	КонецЕсли;
	
	СтруктураНастроек.СохранятьЭлектронныеПисьма = СохранятьЭлектронныеПисьма;
	
	НастройкиСервисаПочтовойРассылки = СтруктураНастроек.НастройкиСервисаПочтовойРассылки;
	ЗаполнитьЗначенияСвойств(НастройкиСервисаПочтовойРассылки, ЭтаФорма);
	СтруктураНастроек.Вставить("ПодключенСервисПочтовойРассылки", ПодключенСервисПочтовойРассылки);
	
	// Подписи
	ПодписиСообщений = СтруктураНастроек.ПодписиСообщений;
	ЗаполнитьЗначенияСвойств(ПодписиСообщений, ЭтаФорма);
	
	// Использование подсистемы
	СтруктураНастроек.СтрокаСоединенияРабочейБазы = СтрокаСоединения;
	
	// СМС
	НастройкиСМС = СтруктураНастроек.НастройкиСМС;
	ЗаполнитьЗначенияСвойств(НастройкиСМС, ЭтаФорма);
	
	Константы.ПЛ_НастройкиУведомлений.СоздатьМенеджерЗначения().СохранитьНастройки(СтруктураНастроек);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	
	// Почта
	
	Элементы.УчетнаяЗаписьИзКонфигурации.Видимость   = Не УчетнаяЗаписьУказываетсяВручную И ВерсияУТ <> "Розница";
	Элементы.СохранятьЭлектронныеПисьма.Видимость    = Не УчетнаяЗаписьУказываетсяВручную И ВерсияУТ <> "Розница";
	
	ЭлементыРучногоУказанияУчетнойЗаписи = Новый Массив;
	ЭлементыРучногоУказанияУчетнойЗаписи.Добавить(Элементы.Пользователь);
	ЭлементыРучногоУказанияУчетнойЗаписи.Добавить(Элементы.Пароль);
	ЭлементыРучногоУказанияУчетнойЗаписи.Добавить(Элементы.АдресСервераSMTP);
	ЭлементыРучногоУказанияУчетнойЗаписи.Добавить(Элементы.АдресСервераPOP3);
	ЭлементыРучногоУказанияУчетнойЗаписи.Добавить(Элементы.ПортSMTP);
	ЭлементыРучногоУказанияУчетнойЗаписи.Добавить(Элементы.ПортPOP);
	ЭлементыРучногоУказанияУчетнойЗаписи.Добавить(Элементы.ИспользоватьSSLSMTP);
	ЭлементыРучногоУказанияУчетнойЗаписи.Добавить(Элементы.Декорация1);
	ЭлементыРучногоУказанияУчетнойЗаписи.Добавить(Элементы.КнопкаПроверитьУчетнуюЗапись);
	
	Для каждого ЭлементМассива Из ЭлементыРучногоУказанияУчетнойЗаписи Цикл
		ЭлементМассива.Видимость = УчетнаяЗаписьУказываетсяВручную;
	КонецЦикла;
	
	// СМС
	
	Элементы.ГруппаСМС.Видимость = ПЛ_УведомленияОСобытиях.Платформа83();
	
	Элементы.НастроитьСМС.Видимость          = СМСДоступны;
	Элементы.СохранятьСообщенияСМС.Видимость = СМСДоступны И ВерсияУТ <> "Розница";
	
	ЭлементыРучнойНастройкиСМС = Новый Массив;
	ЭлементыРучнойНастройкиСМС.Добавить(Элементы.ПровайдерСМС);
	ЭлементыРучнойНастройкиСМС.Добавить(Элементы.ЛогинСМС);
	ЭлементыРучнойНастройкиСМС.Добавить(Элементы.ПарольСМС);
	ЭлементыРучнойНастройкиСМС.Добавить(Элементы.ИмяОтправителяСМС);
	ЭлементыРучнойНастройкиСМС.Добавить(Элементы.ДобавлятьКодСтраны);
	ЭлементыРучнойНастройкиСМС.Добавить(Элементы.ТелефонныйКодСтраны);
	
	Для каждого ЭлементМассива Из ЭлементыРучнойНастройкиСМС Цикл
		ЭлементМассива.Видимость = Не СМСДоступны;
	КонецЦикла;
	
	Элементы.ТелефонныйКодСтраны.Доступность = ДобавлятьКодСтраны;
	
	// Рассылки
	
	Если ПодключенСервисПочтовойРассылки Тогда
		Элементы.ДекорацияПодключен.Видимость = Истина;
		Элементы.ПодключитьНастроитьСервисРассылок.Заголовок = НСтр("ru = 'Настроить'");
	Иначе
		Элементы.ДекорацияПодключен.Видимость = Ложь;
		Элементы.ПодключитьНастроитьСервисРассылок.Заголовок = НСтр("ru = 'Подключить'");
	КонецЕсли;
	
	Элементы.ПодключитьНастроитьСервисРассылок.Видимость = ЗначениеЗаполнено(СервисПочтовойРассылки);
	
	СтрокиПодсказки = Новый Массив;
	СтрокиПодсказки.Добавить(НСтр("ru = 'Подробнее о сервисе на'") + " ");
	Если СервисПочтовойРассылки = Перечисления.ПЛ_СервисыПочтовойРассылки.Sendsay Тогда
		СтрокиПодсказки.Добавить(ПЛ_Функции83.ФорматированнаяСтрокаПоОписанию("sendsay.ru",,,,"https://sendsay.ru/"));
		Элементы.СервисРассылкиСсылка.Видимость = Истина;
	ИначеЕсли СервисПочтовойРассылки = Перечисления.ПЛ_СервисыПочтовойРассылки.UniSender Тогда
		СтрокиПодсказки.Добавить(ПЛ_Функции83.ФорматированнаяСтрокаПоОписанию("unisender.com",,,,"https://unisender.com/"));
		Элементы.СервисРассылкиСсылка.Видимость = Истина;
	ИначеЕсли СервисПочтовойРассылки = Перечисления.ПЛ_СервисыПочтовойРассылки.Mailchimp Тогда
		СтрокиПодсказки.Добавить(ПЛ_Функции83.ФорматированнаяСтрокаПоОписанию("mailchimp.сom",,,,"https://mailchimp.com/"));
		Элементы.СервисРассылкиСсылка.Видимость = Истина;
	Иначе
		Элементы.СервисРассылкиСсылка.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.СервисРассылкиСсылка.Заголовок = ПЛ_Функции83.ФорматированнаяСтрокаИзМассиваСтрок(СтрокиПодсказки);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьТекстНастройкиСМС()
	
	НастройкиОтправкиSMS = Неопределено;
	Провайдер = "";
	
	Попытка
		Выполнить("НастройкиОтправкиSMS = ОтправкаSMSПовтИсп.НастройкиОтправкиSMS()");
		Выполнить("Провайдер = Строка(НастройкиОтправкиSMS.Провайдер)");
	Исключение
	КонецПопытки;
	
	Если ЗначениеЗаполнено(Провайдер) Тогда
		Элементы.НастроитьСМС.Заголовок = Провайдер;
	Иначе
		Элементы.НастроитьСМС.Заголовок = НСтр("ru = 'Настроить'");
	КонецЕсли;
	
КонецПроцедуры
